{
  "topics": [
    {
      "topic": "Introduction to Differential Forms",
      "sub_topics": [
        "Differential forms generalize functions and vectors, enabling integration on manifolds and coordinate-independent representation of physical phenomena. A k-form is a skew-symmetric covariant tensor of rank k, distinguished by its sign inversion upon swapping two inputs. The exterior derivative transforms a k-form into a (k+1)-form, generalizing gradient, curl, and divergence to manifolds.",
        "Visualize 1-forms as fields assigning a number to each tangent vector, representing work done by a force along an infinitesimal path. 2-forms are oriented areas measuring flux through a surface, such as magnetic field flux. 3-forms are oriented volumes, describing densities and fluxes in three-dimensional spaces."
      ]
    },
    {
      "topic": "Wedge Product",
      "sub_topics": [
        "The wedge product (exterior product) combines two differential forms to create a new form of higher degree, preserving antisymmetry. The wedge product of a p-form and a q-form results in a (p+q)-form, antisymmetric in all its entries. It's fundamental for constructing higher-degree forms from 1-forms and defining integrals on manifolds. The wedge product enables building geometric objects like oriented areas and volumes, essential for calculus on manifolds."
      ]
    },
    {
      "topic": "Exterior Differentiation",
      "sub_topics": [
        "Exterior differentiation transforms a k-form into a (k+1)-form, generalizing gradient, curl, and divergence. The exterior derivative of a function (0-form) is its differential, representing the function's rate of change in each direction. The exterior derivative of a 1-form relates to the curl of a vector field, measuring a field's tendency to 'rotate' around a point. The exterior derivative of a 2-form relates to the divergence of a vector field, measuring a field's tendency to 'spread' from a point. Exterior differentiation satisfies d² = 0, fundamental for De Rham cohomology and formulating physical laws like Maxwell's equations."
      ]
    },
    {
      "topic": "Push-forwards and Pull-backs",
      "sub_topics": [
        "Push-forward maps tangent vectors from one manifold to another via a smooth map, allowing vector information transfer between spaces. Pull-back maps differential forms from one manifold to another via a smooth map, essential for variable changes in integrals and operations. The pull-back of a form α by a function φ is defined as (φ*α)p(v1,...,vk) = α(φ*(v1),..., φ*(vk)), where φ* is the push-forward, ensuring the resulting form is in the starting space.",
        "Push-forwards transport vector fields, while pull-backs transport differential forms. Pull-backs are compatible with the wedge product and exterior differentiation, making them powerful tools for variable changes and studying manifold geometry. Push-forwards and pull-backs are fundamental for defining tensor and differential form transformations under coordinate changes, ensuring the invariance of physical laws under different reference systems."
      ]
    },
    {
      "topic": "Change of Variables and Integration of Forms",
      "sub_topics": [
        "Integrating differential forms generalizes integrating functions in Euclidean spaces to manifolds, allowing calculation of fluxes and other geometric quantities. Variable changes in differential form integrals use pull-backs, transforming the original form into a new form defined in the new coordinate system.",
        "Manifold orientation is crucial for form integration, determining the integral's sign. Integrating an n-form on an oriented n-manifold results in a real number, representing the form's flux through the manifold. Variable changes in multiple integrals are naturally expressed via differential form pull-backs, simplifying notation and generalizing the concept to manifolds. The integral of a k-form over an oriented k-chain is defined by summing the integrals over the singular k-cubes composing the chain, considering orientation. Orientation is crucial in differential form integration, as reversing chain orientation changes the integral's sign, reflecting the forms' skew-symmetry."
      ]
    },
    {
      "topic": "Poincaré Lemma",
      "sub_topics": [
        "The Poincaré Lemma states that every closed form (form whose exterior derivative is zero) is locally exact (can be written as the exterior derivative of another form) in a contractible set. It implies that the De Rham cohomology of a contractible set is trivial, meaning there are no closed forms that are not exact. The lemma is fundamental for solving differential equations and constructing potentials in physics.",
        "The lemma is a powerful tool for simplifying calculations involving differential forms, allowing closed forms to be replaced with exact forms in local contexts, facilitating integration and other operations. The Poincaré lemma is a consequence of homotopy and contraction, showing that closed forms in contractible spaces are always exact, reflecting the absence of 'holes' in the space's topology."
      ]
    },
    {
      "topic": "Vector Calculus and Differential Forms",
      "sub_topics": [
        "Vector calculus operations (gradient, curl, divergence) can be expressed in terms of differential forms and exterior differentiation. A function's gradient is a 1-form, a vector field's curl is a 1-form (in 3D) or a 2-form, and a vector field's divergence is a 2-form (in 3D) or a 3-form.",
        "Vector calculus identities, like curl(grad f) = 0 and div(curl F) = 0, are consequences of the d² = 0 property of exterior differentiation. Formulating vector calculus in terms of differential forms is coordinate system-independent and generalizes naturally to arbitrary-dimension manifolds. The gradient of a function corresponds to the 1-form obtained by the function's exterior derivative, representing the direction and maximum rate of change of the function at each point. The curl of a vector field in three dimensions corresponds to a 2-form, whose exterior derivative is related to the vector field's divergence, connecting the operations of vector calculus. The divergence of a vector field corresponds to the exterior derivative of a 2-form associated with the field, allowing the divergence theorem (of Gauss) to be expressed in terms of differential forms."
      ]
    },
    {
      "topic": "Manifolds",
      "sub_topics": [
        "A manifold is a topological space that locally resembles Euclidean space but globally may have a more complex structure. Manifolds are described by charts (smooth maps from open subsets of Euclidean space to the manifold) and atlases (collections of charts that cover the manifold). Manifolds can be orientable (admit a consistent choice of orientation) or non-orientable (do not admit such a choice). Examples of manifolds include spheres, tori, projective spaces, and Lie groups.",
        "Charts and atlases are tools to map regions of a manifold to Euclidean space, allowing local coordinates to be defined and calculations to be performed in terms of these coordinates. A manifold's differentiable structure is defined by chart compatibility, ensuring coordinate changes between different charts are smooth, allowing derivatives and integrals to be defined. Examples of manifolds include curves, surfaces, projective spaces, and Lie groups, each with its own geometric and topological properties."
      ]
    },
    {
      "topic": "Generalized Stokes' Theorem",
      "sub_topics": [
        "The generalized Stokes' Theorem relates the integral of a differential form over a manifold's boundary to the integral of the form's exterior derivative over the manifold. It generalizes the Fundamental Theorem of Calculus, Green's Theorem, the classical Stokes' Theorem, and the Divergence Theorem. Stokes' Theorem is fundamental to physics, relating integral laws with differential laws and allowing the derivation of conservation laws.",
        "The generalized Stokes' Theorem relates the integral of a differential form over the boundary of a chain with the integral of the exterior derivative of the form over the chain, unifying several calculus theorems into a single formulation. The theorem is a fundamental tool for studying manifolds and differential forms, allowing local and global properties to be related and simplifying calculations involving integrals. Special cases of the theorem include the fundamental theorem of calculus, Green's theorem, the classical Stokes' theorem, and the divergence theorem (of Gauss), demonstrating its generality and importance."
      ]
    },
    {
      "topic": "Visualization of Differential Forms",
      "sub_topics": [
        "A 1-form can be visualized as a field of co-vectors acting on vectors to produce a scalar, representing, for example, the work done by a force along a path. A 2-form can be understood as a measure of oriented area, acting on pairs of vectors to give the flux through a parallelogram, as in calculating flux of vector fields. A 3-form, in a three-dimensional space, measures oriented volume, associating each triplet of vectors a number that represents the volume of the parallelepiped defined by them, analogous to the determinant of a 3x3 matrix."
      ]
    },
    {
      "topic": "Introduction to Tensors",
      "sub_topics": [
        "Contravariant tensors are defined as objects that transform according to a specific equation under a change of basis and can be interpreted as vector fields. Covariant and contravariant tensors are distinguished by their transformation rules under changes of basis; covariant tensors transform inversely to the transformation of the basis, while contravariant tensors transform directly.",
        "The exterior differentiation is used to derive the transformation rules for base elements of T*M, resulting in a Jacobian matrix that describes how the coordinates transform under changes of basis, crucial for understanding how differential forms behave in different coordinate systems. Einstein notation simplifies tensor expressions, summing over repeated indices, which is essential for writing base transformations concisely and performing calculations with tensors and differential forms. Vector base elements transform covariantly, while the base elements of a form transform contravariantly, reflecting their role as linear maps that act on vectors, ensuring that physical quantities remain invariant under coordinate transformations. Contravariant tensors 'eat' 1-forms, mapping 1-forms to real numbers, while the components of the contravariant tensor transform like base elements of 1-form, highlighting the duality between vectors and 1-forms in the tangent space. Tensor analysis provides a framework for describing geometric and physical objects independently of coordinate choice, ensuring that physical laws are expressed invariantly.",
        "Base elements of T*M (cotangent space) transform covariantly, following a specific transformation rule involving partial derivatives of coordinates. Contravariant tensors 'consume' 1-forms, and their components transform similarly to the base elements of 1-forms."
      ]
    },
    {
      "topic": "Rank-Two Tensors",
      "sub_topics": [
        "Rank-two tensors are multilinear maps that generalize the concept of vectors and differential forms, with three types: covariant, contravariant, and mixed, each transforming distinctly under base changes and acting on different vector and 1-form combinations.",
        "Covariant rank-two tensors (type (0,2)) map two vectors to a real number, forming a vector space that includes 2-forms as a subset but also contains non-alternating tensors like the metric tensor, crucial for defining inner products and distances. The Cartesian product of vector spaces V and W, denoted V × W, is the set of all ordered pairs (v, w) where v ∈ V and w ∈ W, forming the basis for constructing tensor spaces and defining multilinear maps, though it needs refinement to capture multilinearity. The tensor space T*M ⊗ T*M is constructed from equivalence classes of the Cartesian product T*M × T*M, representing multilinear maps in the form dx¹ ⊗ dx², essential for defining covariant rank-two tensors and ensuring the transformation is linear in each 'slot'. The covariant transformation of each index in a covariant rank-two tensor ensures the tensor transforms correctly under base changes, maintaining its geometric identity and allowing consistent calculations in different coordinate systems.",
        "2-forms are the skew-symmetric elements of T*M ⊗ T*M, meaning that swapping the order of the input vectors changes the sign of the result, an essential property for defining oriented area and volume forms in manifolds. Contravariant rank-two tensors (type (2,0)) map two 1-forms to a real number, transforming contravariantly with each index and forming the basis for constructing tensor fields and differential operators intrinsic to the manifold."
      ]
    },
    {
      "topic": "General Tensors",
      "sub_topics": [
        "A general tensor of type (r, s) is a multilinear map that acts on r 1-forms and s vectors, producing a real number, and its components transform according to the tensorial transformation rule, ensuring that physical laws are expressed invariantly under coordinate transformations. The pullback of a covariant tensor of rank (0, t) is defined analogously to the pullback of differential forms, ensuring that tensor operations are compatible with maps between manifolds and preserving geometric relations.",
        "The pullback distributes over the tensorial product of covariant and contravariant tensors, preserving the algebraic structure and ensuring that calculations involving tensorial products are consistent under transformations. The pullback of a mixed tensor (s, t) is defined involving push-forwards of the 1-forms and pullbacks of the vectors, ensuring that the transformation is compatible with the mixed structure of the tensor and preserving geometric relations.",
        "Differential forms are skew-symmetric tensors, meaning that swapping any two arguments changes the sign of the result, an essential property for defining oriented area and volume forms in manifolds, and are a subset of covariant tensors. A general tensor (r, s) is a multilinear map of contravariant degree r and covariant degree s, mapping T*M × ... × T*M × TM × ... × TM to R. The transformation of the components of a general tensor (r, s) involves applying partial derivatives for both the contravariant and covariant indices. The pullback of a covariant tensor of rank (0, t) is defined as (φ*Tp(p))(v1p,..., vtp) = Tp(φ(p))(φ*v1p,..., φ*vtp), analogous to the pullback of differential forms. The pullback of a contravariant tensor of rank (t, 0) is defined as (φ*Tp(p))(α1p,..., αtp) = Tp(φ(p))((φ⁻¹)*α1p,..., (φ⁻¹)*αtp), using the inverse of the push-forward. The pullback of a mixed tensor (s, t) is defined by combining the transformations for covariant and contravariant tensors, ensuring the correct transformation under coordinate changes."
      ]
    },
    {
      "topic": "Differential Forms as Skew-Symmetric Tensors",
      "sub_topics": [
        "A k-form is a totally skew-symmetric covariant tensor of rank k, meaning that swapping any two arguments inverts the sign, and is a subset of the set of all covariant tensors of rank k, commonly used for integration and defining fluxes in manifolds. The skew-symmetry of a k-form is expressed in terms of permutations of the arguments, where the sign of the permutation determines the sign of the result, ensuring that the form transforms correctly under changes of orientation.",
        "The wedge product of a k-form α and an l-form β is defined using the skew-symmetrization operator A, which ensures that the result is a skew-symmetric (k+l)-form, essential for constructing higher-degree forms from lower-degree forms. The skew-symmetrization operator A transforms a p-tensor into a skew-symmetric tensor, summing over all permutations of the arguments with the appropriate signs, crucial for constructing differential forms from more general tensors. The pullback distributes over the wedge product of differential forms, preserving the algebraic structure and ensuring that calculations involving wedge products are consistent under transformations, which simplifies the analysis of geometric and physical systems. The wedge product of two differential forms results in a new differential form whose degree is the sum of the degrees of the original forms, and is a fundamental concept in differential geometry and algebraic topology, used to define cohomology and construct topological invariants."
      ]
    },
    {
      "topic": "The Metric Tensor",
      "sub_topics": [
        "A metric tensor on a manifold M is a smooth, symmetric, and non-degenerate covariant tensor of rank two, denoted by g, used to define lengths, angles, and volumes on the manifold, and is fundamental to Riemannian geometry and relativity. Smoothness of a metric tensor g means that the component functions gᵢⱼ(x₁, ..., xₙ) are differentiable an infinite number of times with respect to the arguments x₁, ..., xₙ, ensuring that the geometric properties of the manifold vary smoothly.",
        "Symmetry of a metric tensor g means that g(v, w) = g(w, v) for all smooth vector fields v and w, ensuring that the inner product defined by the metric tensor is commutative. Non-degeneracy of a metric tensor g means that if gₚ(vₚ, wₚ) = 0 for any choice of vector vₚ, then wₚ = 0, ensuring that the metric tensor defines a non-singular inner product on each tangent space. A manifold with a tensor g is called a pseudo-Riemannian manifold, and if g(v, w) ≥ 0 for all vector fields v and w, then it is called a Riemannian manifold, defining a notion of distance and angle at each point of the manifold.",
        "The metric tensor g provides an inner product in each vector space TₚM in the tangent bundle of M, given by g(vₚ, wₚ), allowing lengths of vectors and angles between vectors to be defined at each point of the manifold. The length of a vector vₚ at a point p is defined as ||vₚ|| = √|g(vₚ, vₚ)|, where the absolute value is necessary for pseudo-Riemannian tensors, and the length of the curve γ from p to q is defined by integrating the square root of the absolute value of g(γ'(t), γ'(t)) along the curve."
      ]
    },
    {
      "topic": "Lie Derivatives of Tensor Fields",
      "sub_topics": [
        "The Lie derivative, denoted by Lᵥ, quantifies the rate of change of a tensor field along the flow generated by a vector field ᵥ, capturing how the tensor field evolves along the integral curves of ᵥ.",
        "The Lie derivative of a vector field w in the direction of v at a point p, denoted by (Lᵥw)ₚ, is defined as the limit of the difference between the pullback of w along the flow of v and w, divided by the time parameter, measuring how w changes infinitesimally along the flow of v. The Lie derivative satisfies a variety of notations, including (Lᵥw)ₚ, lim(t→0) (γ⁻ᵗ*wγᵗ(p) - wp) / t, and lim(t→0) (γ⁻ᵗ*w(p) - wp) / t, all expressing the same rate of change of the vector field w along the flow of v.",
        "The Lie derivative of a 1-form α in the direction of v at a point p, denoted by (Lᵥα)ₚ, is defined analogously to the Lie derivative of a vector field, but using the pullback instead of the push-forward, capturing how α changes along the flow of v. The Lie derivative of a function f is simply the directional derivative of f in the direction of v, given by (Lᵥf)ₚ = vₚ[f], showing that the Lie derivative generalizes the notion of directional derivative for tensor fields. The Lie derivative of a tensor (r, s) is defined using the pullback of the tensor along the flow of v, measuring how the tensor changes infinitesimally along the flow of v, and is a fundamental concept in differential geometry.",
        "The Lie derivative satisfies various important identities, including linearity, the product rule for tensor products, and the relation with the exterior derivative, providing powerful tools for calculating and manipulating Lie derivatives."
      ]
    },
    {
      "topic": "Cartan's Homotopy Formula",
      "sub_topics": [
        "Cartan's homotopy formula, or Cartan's magic formula, relates the Lie derivative, the exterior derivative, and the interior product, providing a fundamental tool for simplifying calculations and proving identities in differential geometry.",
        "Cartan's homotopy formula states that Lᵥα = ιᵥ(dα) + d(ιᵥα), where Lᵥ is the Lie derivative, d is the exterior derivative, and ιᵥ is the interior product, connecting these operators in a profound way. The Lie derivative of a wedge product can be expressed in terms of the Lie derivatives of the individual forms, showing that the Lie derivative is a derivation in the algebra of differential forms, preserving the algebraic structure.",
        "The exterior derivative of the Lie derivative of a differential form is equal to the Lie derivative of the exterior derivative of the form, showing that the Lie derivative commutes with the exterior derivative, which simplifies calculations and reveals the underlying structure. The Lie derivative of a vector field w in the direction of v is equal to the commutator of v and w, denoted by [v, w], connecting the Lie derivative to the concept of commutation of vector fields, which is fundamental in differential geometry.",
        "The global formula for the Lie derivative of differential forms expresses the Lie derivative in terms of the directional derivative and the commutator, providing a computational tool for calculating Lie derivatives without using coordinates."
      ]
    },
    {
      "topic": "Global Formula for Exterior Derivative",
      "sub_topics": [
        "The global formula for the exterior derivative expresses the exterior derivative of a k-form in terms of a sum of directional derivatives and commutators, providing a coordinate-independent definition of the exterior derivative.",
        "The global formula for the exterior derivative of a k-form α is given by (dα)(v₀, ..., vₖ) = Σᵢ (-1)ⁱ vᵢ[α(v₀, ..., ṽᵢ, ..., vₖ)] + Σᵢ<ⱼ (-1)ⁱ⁺ʲ α([vᵢ, vⱼ], v₀, ..., ṽᵢ, ..., ṽⱼ, ..., vₖ), where ṽᵢ denotes the omission of vᵢ.",
        "The global formula for the exterior derivative can be proven by induction, starting with the base case of a 1-form and then generalizing to k-forms, using Cartan's homotopy formula and the properties of the Lie derivative, demonstrating its general validity. The global formula for the exterior derivative is independent of the choice of coordinates, making it a powerful tool for calculating exterior derivatives on manifolds without relying on specific coordinate systems.",
        "The global formula for the exterior derivative can be used to define the exterior derivative, which is fundamental in differential geometry and algebraic topology, used to define cohomology and construct topological invariants. The global formula for the exterior derivative simplifies to the base case formula for a 1-form, demonstrating the consistency of the general formula and providing a computational tool for calculating exterior derivatives of 1-forms without using coordinates. The global formula for the exterior derivative expresses the exterior derivative in terms of directional derivatives and commutators, connecting the exterior derivative to the notion of variation and commutation of vector fields, which is fundamental in differential geometry."
      ]
    },
    {
      "topic": "Rank Two Tensors",
      "sub_topics": [
        "Tensors (0,2) are multilinear maps that receive two vectors as input and return a scalar, with two-forms being a subset of these tensors. The Cartesian product of vector spaces V and W is defined as the set of ordered pairs (v, w) where v ∈ V and w ∈ W, forming the basis for the construction of tensors. Tensors are multilinear, meaning that the application of the tensor is linear in each 'slot', that is, T(av1 + bv2, w) = aT(v1, w) + bT(v2, w).",
        "The tensor space T*M ⊗ T*M is composed of linear combinations of elements of the form dx¹ ⊗ dx¹, called the tensorial product of dx¹ and dx². The action of dx¹ ⊗ dx² on vector fields v and w is defined as dx¹ ⊗ dx²(v, w) = dx¹(v)dx²(w), mapping pairs of vectors to scalars. Covariant tensors of rank two transform covariantly, with each index transforming according to the tensorial transformation rule that involves partial derivatives of the coordinates. Two-forms are skew-symmetric elements of T*M ⊗ T*M, which means that dx¹ ∧ dx²(v, w) = -dx¹ ∧ dx²(w, v), and are a subset of the tensors (0,2)."
      ]
    },
    {
      "topic": "Contravariant Tensors of Rank Two",
      "sub_topics": [
        "Tensors (2,0) are multilinear maps that receive two 1-forms as input and return a scalar, being elements of the vector space TM ⊗ TM. The transformation of contravariant tensors of rank two follows a specific rule where each index transforms contravariantly, involving partial derivatives of the inverse coordinates. Mixed tensors (1,1) receive a vector and a 1-form as input and return a scalar, being elements of the vector space TM ⊗ T*M."
      ]
    },
    {
      "topic": "Differential Forms as Skew-Symmetric Tensors",
      "sub_topics": [
        "A k-form is a covariant tensor of rank k that is fully skew-symmetric, transforming with a sign according to the permutation of its arguments. The relation between k-forms and tensors (0, k) is that the set of k-forms is a subset of the set of tensors (0, k), specifically the skew-symmetric tensors.",
        "The wedge product of a k-form α and an l-form β is defined using the skew-symmetrization operator A, resulting in α ∧ β = ((k + l)! / k!l!) A(α ⊗ β). The skew-symmetrization operator A transforms a tensor p into a skew-symmetric tensor A(T)(v1,..., vp) = (1/p!) Σ sgn(π) T(vπ(1),..., vπ(p)), where the sum is over all permutations. The pullback of the wedge product of two forms is the wedge product of the pullbacks, φ*(α ∧ β) = φ*α ∧ φ*β, demonstrating that pullbacks distribute over wedge products. The tensorial metric g defines an inner product in each tangent vector space TpM, allowing the calculation of lengths of vectors and curves in a manifold."
      ]
    },
    {
      "topic": "Lie Derivatives of Tensor Fields",
      "sub_topics": [
        "The Lie derivative measures the rate of change of a tensor field along the flow of a vector field, generalizing the directional derivative. The Lie derivative of a vector field w in the direction of v is defined as (Lvw)p = lim (τγ⁻ᵗ·wγᵗ(p) - wp) / t, where γᵗ is the flow of v.",
        "The Lie derivative of a 1-form α in the direction of v is defined as (Lva)p = lim (τ*γ⁻ᵗ·αγᵗ(p) - αp) / t, analogous to the Lie derivative of vector fields. The Lie derivative of a function f is simply the directional derivative vp[f], indicating that for functions, the Lie derivative coincides with the familiar directional derivative. The Lie derivative of a general tensor T is defined using pullbacks γᵗ*, ensuring that the derivative captures the variation of the tensor along the flow.",
        "The Lie derivative satisfies important identities, such as linearity Lv(aS + bT) = aLvS + bLvT and the relation with the tensorial product Lv(S ⊗ T) = LvS ⊗ T + S ⊗ LvT. The Cartan homotopy formula relates the Lie derivative with the exterior derivative and the interior product: Lᵥα = ιᵥ(da) + d(ιᵥα). The Lie derivative is equal to the commutator of the vector fields, Lw = [v, w] = vw - wv, connecting it to the algebraic properties of the vector fields."
      ]
    },
    {
      "topic": "Global Formula for the Lie Derivative of Differential Forms",
      "sub_topics": [
        "The global formula for the Lie derivative of differential forms expresses Lνα in terms of directional derivatives and commutators, eliminating the need for local coordinates. For a 2-form α, the formula is (Lνα)(w1, w2) = v[α(w1, w2)] - α([v, w1], w2) - α(w1, [v, w2]), generalizing to k-forms with k commutators.",
        "The global formula for the Lie derivative of a general tensor (r, s) involves weighted sums of directional derivatives and commutator terms, capturing the variation of the tensor along the flow. The relation between the Lie derivatives and the exterior differentiation is given by the Cartan homotopy formula: Lᵥα = ιᵥ(da) + d(ιᵥα). The global formula for the exterior differentiation expresses da in terms of directional derivatives and commutators, providing a coordinate-independent definition.",
        "For a k-form α, the formula is (da)(v0, ..., vk) = Σ (-1)ⁱ vi[α(v0, ..., ṽi, ..., vk)] + Σ (-1)ⁱ⁺ʲ α([vi, vj], v0, ..., ṽi, ..., ṽj, ..., vk), where ṽi indicates the omission of the term vi."
      ]
    }
  ]
}