{
  "topics": [
    {
      "topic": "Differentiability",
      "sub_topics": [
        "The differentiability of a function y = f(x) at a point requires the existence of a specific limit, which geometrically implies that the graph of the function must possess a tangent at that point. For multiple variables, such as z = f(x, y), differentiability requires the graph to have a tangent hyperplane. The usual definition of differentiability for y = f(x) at x = a is expressed by the limit of [f(a + Δx) - f(a)] / Δx as Δx approaches zero, resulting in f'(a), which represents the derivative of f at a. This limit can be rewritten to indicate that the numerator vanishes to a higher order than 1.",
        "Geometric differentiability, known as local linearity, means that under sufficient magnification, the graph of f at x = a becomes indistinguishable from the graph of the tangent at that point. For z = f(x, y) at (x, y) = (a, b), differentiability requires the difference between f(a + Δx, b + Δy) and an arbitrary plane (c + pΔx + qΔy) to vanish faster than the horizontal displacement from the point of tangency (a, b).",
        "If a function z = f(x, y) is differentiable at (a, b), then its partial derivatives exist at that point, and the equation of the tangent plane is given by z = f(a, b) + fx(a, b)Δx + fy(a, b)Δy, where the partial derivatives define the tangent plane and are components of the 1 × 2 matrix representing the derivative of f at (a, b). However, the existence of partial derivatives does not guarantee differentiability; a counterexample is the 'Manta Ray' function, f(x,y) = xy / (x² + y²) if (x,y) ≠ (0,0), and f(x,y) = 0 otherwise. Even if the partial derivatives exist at the origin, the function is not differentiable there.",
        "The directional derivative of z = f(x) at the point x = a in the direction of a unit vector u is defined as the rate of change of f along that direction. The existence of directional derivatives in all directions does not guarantee differentiability. However, if z = f(x,y) is differentiable at (a,b), then all directional derivatives exist at (a,b), and D(α,β)f(a,b) = df(a,b)(α,β).",
        "The gradient of z = f(x, y) at (a, b) is the vector ∇f(a, b) in R², whose components are fx(a, b) and fy(a, b), and is related to the directional derivative through the dot product: D(α,β)f(a,b) = ∇f(a,b) · (α,β). Conceptually, ∇f(a,b) and df(a,b) are different; the former is a vector, the latter is a linear map. However, because matrix multiplication involves the dot product, the two are connected.",
        "Local linearity with level curves illustrates how tangents are used to define differentiability. For example, the function f(x, y) = x² - y² at the point (a, b) = (2, -1) has a graph that is a curved surface in R³, and the derivative df(2,-1)(Δx, Δy) = 4Δx + 2Δy is a tangent plane; under sufficient magnification, the graph of f becomes indistinguishable from the tangent plane. By comparing the level sets of f and df(2,-1) in windows centered at (2, −1) in the (x,y) plane, the local linearity of f becomes apparent under magnification. The level curves of f become essentially straight, parallel, and evenly spaced, which are the characteristics of a linear function. Moreover, the function and its derivative agree exactly on the diagonals.",
        "Differentiability, expressed in terms of 'little oh', requires that the numerator of the limit expression, as a function of Δx, converges to zero faster than Δx; specifically, the expression (f(a + Δx) - f(a) - f'(a)Δx) / Δx must tend to zero when Δx approaches zero. This means that the function approaches its linearization near a point.",
        "The Taylor theorem provides a formula for approximating a function using its derivatives at a specific point; differentiability requires that the remaining term in the Taylor approximation vanishes faster than the distance to the point, ensuring that the linear approximation is accurate near that point."
      ]
    },
    {
      "topic": "Maps of the Plane",
      "sub_topics": [
        "The goal is to understand what differentiability means geometrically for a map of the plane, where a map f: U² → R² has the coordinate form x = f(u, v), y = g(u, v), with U² being a window of the form |u –a|<p, |v-b|< q.",
        "The derivative of f at the point a = (a, b) is the linear map dfa: R² → R² whose coordinate matrix is dfa(a,b) = (fx(a,b) fy(a,b); gx(a,b) gy(a,b)), and differentiability manifests as local linearity: we compare the image of f in a microscope window centered at a with the image of the linear map dfa in that window.",
        "According to Taylor's theorem, any smooth map is approximately a polynomial when its domain is restricted to a small enough region. The closeness of the approximation is directly related to the degree of the polynomial, but even a linear polynomial can provide an impressive approximation.",
        "The change of polar coordinates is the map that pulls back Cartesian coordinates to polar coordinates: f: x = rcos θ, y = r sin θ, where the map f places a grid of rays and concentric circles in the (x,y) plane, corresponding to the rectangular grid θ = constant and r = constant in the (r, θ) plane.",
        "Near (3, π/6), f is a stretching and rotation, where the line Δθ = 0 in the source (the Ar axis) is just the horizontal line θ = π/6, so its image is the radial line making an angle of π/6 radians, or 30°, as it passes through the origin (Δx, Δy) = (0, 0) of the microscope window in the target. In other words, f rotates the Ar axis by 30°; the figure makes it clear that the entire (Δr, Δθ) plane undergoes essentially the same rotation.",
        "The derivative df(ro,θo) splits into two factors: first, S1,ro stretches the plane vertically (that is, in the direction of the Δθ axis) by the factor ro; then Rθo rotates the result by θo radians, so the linear approximation of f is its derivative dfa.",
        "A map f : U2 → R2 : u → x will be locally linear or differentiable at a point u = a if Δx = f(a + Δu) – f(a) differs from a linear function of Δu by a quantity that vanishes faster than Δu. The theorem makes it clear that, if f is locally linear at a, then its linear approximation is its derivative dfa; note that, if we rewrite the window equation Δx = f(a + Δu) – f(a) = dfa (Δu) + o(1) without the remainder term o(1), we obtain an approximation that is, in effect, a new form of the microscope equation: Δx ≈ dfu (Δu).",
        "If f : U2 → R2 is differentiable at a, its local area multiplier at a is the area multiplier of its derivative dfa; for the polar coordinate map x = f(r), we find that the area multiplier of dfro is ro: det dfro = ro cos² θo + ro sin² θo = ro.",
        "For plane maps f like the polar coordinate map, we use the notions f is arbitrarily close to dfa near a and f 'looks like' dfa near a more or less interchangeably. However, the two are subtly different. The first, of course, is what we now call local linearity. The second, however, may not be true if dfa is not invertible; it is a stronger condition.",
        "For the quadratic map f: R² → R², defined by the equations x = u² – v², y = 2uv, the action of the change of polar coordinates was immediately evident on a global level (that is, on the entire right half-plane r > 0). However, the action is not hard to describe; we now show that f squares the distance of any point from the origin and doubles the angle that that point makes with the positive horizontal axis.",
        "Approximating the quadratic map by its derivative dfa near a point depends on whether the derivative is invertible or not. If the derivative is invertible, then f looks like its linearization in a microscope window centered at a. Otherwise, f may not look like its linearization in a microscope window centered at a."
      ]
    },
    {
      "topic": "Parametrized Surfaces",
      "sub_topics": [
        "A parametrized surface is the image of a map f: U² → R³ from a two-dimensional region U², where the goal is to see how the derivative dfu is related to the map f near u. This allows us to analyze the local properties of the surface.",
        "Our first example is the unit sphere in R³, given parametrically as f: x = cos θ cos φ, y = sin θ cos φ, z = sin φ; the image is indeed the unit sphere centered at the origin because each point of the image is exactly 1 unit from the origin: x² + y² + z² = cos² θ cos² φ + sin² θ cos² φ + sin² φ = cos² φ + sin² φ = 1.",
        "The target window is three-dimensional, so each target window will be a small cube. The image is the portion of the sphere that lies in this window; it is nearly flat because the window is small. It approximates the plane Ay = 0, that is, the (Ax, Az) plane. It looks as though f preserves lengths and angles: the image grid has the same size and shape as the source grid.",
        "Visual evidence indicates that df(π/2,0) is just the 'flattening' of f in a microscope window centered at (π/2,0); it seems reasonable to say that f is locally linear at (π/2,0) and 'looks like' its derivative there.",
        "The local area multiplier for a parametrized surface is given by the determinant of the derivative dfa: R² → R³. At an arbitrary point (θ, φ) in the domain of the sphere parametrization, the local area multiplier is cos φ. An application is that a unit square maps to a rectangle with area 1/2; the local area multiplier at (π/4, π/3) appears to be 1/2.",
        "The next example is called the crosscap; it has a simple parametrization f : R² → R³ in terms of polynomials defined on the entire plane: x = u, y = uv, z = -v². The crosscap is a surface with self-intersection, and its parametrization provides a way to study its geometric and topological properties.",
        "The image is a kind of parabolic arch that 'crosses' through itself in the manner shown in the figure. The u axis is mapped to the x axis along the crest of the arch. The image of the v axis folds back over itself along the line of self-intersection; both halves map to the negative z axis.",
        "In our study of the quadratic map in the previous section, we noted that the quadratic map (pp. 116–121) failed to look like its derivative locally at a point where the derivative itself failed to be invertible; invertibility is out of the question here, because the source and target have different dimensions (the derivative is not a square matrix); the appropriate analogue is maximal rank.",
        "If dfa has maximal rank, f will look like dfa near a."
      ]
    },
    {
      "topic": "The Chain Rule",
      "sub_topics": [
        "The chain rule provides a formula for the derivative of a composite function, which is a function that is formed by the composition of two or more functions, and states that the derivative of the composite function is the product of the derivatives of the individual functions.",
        "The theorem shows that L is unique and we continue to equate differentiability and local linearity: f is differentiable at a if and only if Δx = f(a + Δu) - f(a) agrees with the linear map dfa(Δu) to an order greater than 1.",
        "Given two functions f, g: UP → Rq, their sum and difference, (f ± g)(u) = f(u) ± g(u), are also maps of the same type: f ± g: UP → Rq, so that if f and g are differentiable on UP, then f ± g are also, and d(f ± g)a(Δu) = dfa(Δu) ± dga(Δu) at any point a in UP.",
        "If f, g: UP → Rq are differentiable on UP, then the dot product f · g: UP → R is also, and d(f · g)a(Δu) = f(a) · dga(Δu) + dfa(Δu) · g(a), so that the chain rule for functions of a single variable is commonly written in two different ways, corresponding to the two ways we write derivatives.",
        "If f: UP → Rq and φ: Sq → Rr are differentiable maps with the image of f contained in the domain of φ: f(UP) ⊆ Sq, then the composite φ ∘ f: UP → Rr is defined for all u in UP: (φ ∘ f)(u) = φ(f(u)).",
        "The chain rule for maps says that the derivative of a composite is the composite of its derivatives, where the theorem is stated and proved below, and you should check that the proof is just a rigorous version of the following “plausibility argument” based on the microscope equations for f, φ, and φ ∘ f.",
        "The corollary focuses our attention on maps f: Un → S whose source and target have the same dimension, where the corollary implies that the local volume multiplier of a composite is the product of its individual multipliers, as one would expect.",
        "In elementary calculus, every formula is assembled from a few simple types of functions—think of them as “atoms”—using arithmetic and composition; we compute the derivative of any such formula by knowing the derivatives of the atoms and the rules for differentiating arbitrary sums, products, quotients, and chains (or compositions).",
        "The Jacobian is the determinant of the derivative of a function, and plays an important role in multiple integrals, and is analogous to the factor φ'(s) that appears in the transformation dx = φ'(s)ds of differentials.",
        "The local volume multiplier of a function f at a is det dfa, which is the determinant of the derivative of f at a, and is the amount by which f scales volumes locally; a function is orientation-preserving or orientation-reversing at a according to whether its derivative dfa is orientation-preserving or orientation-reversing.",
        "The chain rule implies that the local volume multiplier of a composition is the product of its individual multipliers, which means that if f: U ⊆ R^n → R^n and g: V ⊆ R^n → R^n are differentiable, then Jg∘f(a) = Jg(f(a))Jf(a), where Jf(a) and Jg(f(a)) are the Jacobians of f and g, respectively."
      ]
    }
  ]
}