{
  "topics": [
    {
      "topic": "Double Integrals",
      "sub_topics": [
        "Double integrals are used to calculate the product of quantities that vary spatially, such as the gravitational force exerted by a homogeneous plate on a point above it. This involves approximating the plate by dividing it into small cells and summing the contributions of each cell to estimate the total gravitational field. The integral of Riemann emerges as the limit of the Riemann sums when the cells become infinitely small, representing the product of two variable quantities (such as force field and area) restricted to small cells where they become almost constant, allowing calculating the numerical value of the integral. The universal law of gravitation of Newton motivates the use of double integrals in calculating the gravitational force exerted between masses, proportional to the masses and inversely proportional to the square of the distance. This involves the concept of a vector field, particularly the gravitational field, defined as a vector function of the position that describes the acceleration of a test particle due to the presence of a mass; calculation of the total gravitational force exerted by a continuous mass distribution.",
        "Double integrals are evaluated through iterated integrals, involving successive integration with respect to each variable while keeping the other constant, allowing calculating the volume under a surface or the total mass of a sheet. The geometric calculation allows defining double integrals as the limit of the product of two quantities that vary continuously over a two-dimensional region, extending the notion of integral to functions of multiple variables. The rigorous mathematical theory establishes that double integrals can be evaluated through iterated integrals, where the integration is performed successively in relation to each variable, allowing the practical calculation of areas and volumes.",
        "Improper integrals are used when the integration limits are infinite or the integrated function is unbounded, calculating the integral as a function of a finite limit and then taking the limit of that function when the finite limit tends to infinity, allowing determining the value of the integral even when the limits are unlimited. The rigorous definition of the improper integral is used to treat cases where the integration domain is unlimited or the integrated function is unlimited; the value of the integral is determined as a limit when the integration limits approach infinity. Improper integrals are defined as limits of double integrals over regions that extend to infinity or contain singularities, allowing the calculation of areas and volumes in more general situations.",
        "In polar coordinates, the double integral is expressed in terms of r and θ, where the area element dA is replaced by r dr dθ, allowing calculating integrals over regions with radial symmetry, such as the gravitational force of a circular plate, dividing the plate into concentric rings and summing the contributions of each ring. The transformation to polar coordinates simplifies double integrals over regions with circular symmetry, allowing the integral to be expressed in terms of radial and angular variables, thus facilitating the evaluation of the integral. The transformation to polar coordinates facilitates the calculation of double integrals in regions with radial symmetry, changing the area element and simplifying the expression of the integral, which is fundamental in problems of physics and engineering. The calculation of the gravitational field of a circular plate using polar coordinates explores the circular symmetry to simplify the integral; the transformation to polar coordinates leads to an improper integral of a variable.",
        "The Jordan content is a precise measure of the size (area) of a region, built by partitioning the region into small pieces and summing their sizes, allowing calculating the area of complex shapes, such as those resulting from transformations of variables. The concept of Jordan content provides a precise definition of area for regions in the plane, essential for the rigorous definition of the double integral and to ensure the existence and uniqueness of the result. The Jordan content provides a precise notion of size that captures the intuitive ideas about area, extends immediately to higher dimensions and fits well with the integration process.",
        "A set is Jordan measurable if and only if the Jordan content of its boundary is zero, meaning that the boundary of the set must be sufficiently 'thin' for the set to have a well-defined Jordan content, connecting the Jordan measurability with the area of the boundary of the set. Subsets of sets with zero Jordan content also have zero Jordan content, and the union of a finite number of sets with zero Jordan content also has zero Jordan content.",
        "The graph of a continuous function in a limited interval has zero Jordan content, implying that the area under the curve of a continuous function can be calculated using the Riemann integral. If S and T are Jordan measurable sets, then their unions and intersections are also Jordan measurable, and if S and T are Jordan measurable sets that do not overlap, then the Jordan content of their union is the sum of their Jordan contents."
      ]
    },
    {
      "topic": "Riemann and Darboux Integrals",
      "sub_topics": [
        "The Riemann integral of a function f(x,y) over a limited set S is defined as the limit of the Riemann sums when the size of the grid of integration approaches zero, representing the approximation of the volume of the solid under the graph of f(x,y) by means of the sum of the volumes of prisms. The Riemann sum for f over S is an expression of the form Σ f(xi, yi) ΔAi, where (xi, yi) is a point of Qi and ΔAi is the area of Qi. This sum approximates the volume under the graph of the function. The double Riemann integral is defined as the limit of the Riemann sums as the mesh size of the grid approaches zero. If this limit exists and is independent of the choice of points (xi, yi), then f is integrable. The rigorous mathematical theory establishes that the double integral of a function over a region can be approximated by Riemann sums, where the region is divided into smaller cells and the function is evaluated at a point within each cell.",
        "Riemann sums are approximated using integration grids, and for continuous and positive functions, f(xi, yi) represents the height of the prism over the cell Qi, while ΔAi represents the area of the base Qi, allowing approximating the total volume of the solid. The geometric interpretation of a Riemann sum as the volume of vertical prisms with bases given by the cells of the partition and heights given by the values of the function; the integral represents the total volume under the surface defined by the function. To interpret such a sum, it helps to let f be positive and continuous, as in the figure above. Then f(xi,yi) is approximately the height of the prism Pi which has base Qi, vertical sides and an irregular top formed by the graph of f; f(xi,yi) ΔAi is approximately its volume.",
        "The Darboux integral is constructed from sums involving the upper and lower bounds of a function in each cell of a grid, defining the upper and lower Darboux integrals and ensuring that these integrals always exist, even when the function is not Riemann integrable. The Darboux sums provide upper and lower limits for all possible Riemann sums that can be constructed with the grid G, and the Lemma 8.7 ensures that no lower sum is greater than any upper sum, establishing a basis for the definition of the Darboux integral.",
        "The lower Darboux integral is the smallest upper bound of the lower Darboux sums, and the upper Darboux integral is the largest lower bound of the upper Darboux sums. If a function is Riemann integrable in S, then it is also Darboux integrable, and the two integrals are equal. If a function is Darboux integrable in S, then it is also Riemann integrable, and the two integrals are equal.",
        "If a function is Riemann integrable, then it is also Darboux integrable, and the two integrals are equal, demonstrating the equivalence of the Riemann and Darboux integrals. This theorem establishes the equivalence of the two approaches for integration. The theorem of the equivalence of Riemann and Darboux integrability: If f is Riemann integrable in S, then it is also Darboux integrable, and the two integrals are equal.",
        "A continuous function over a closed and limited set is integrable, guaranteeing the existence of the double integral and allowing the calculation of areas and volumes in diverse applications. If f is limited and continuous in S\\\\\\\\\\\\, where Z is a subset of S with A(Z) = 0, then f is integrable in S. In addition, restricted Riemann integrals, using only the cells contained in the interior of the integration domain, have the same limit as the unrestricted sums.",
        "Basic properties of the Riemann integral, including linearity, additivity over non-overlapping sets, and the mean value theorem for integrals; these properties are analogous to those of the integrals of a single variable.",
        "The concept of improper integral for unlimited functions or domains, defined as a limit of integrals over limited regions; the existence of the improper integral requires that the limit exists and is finite."
      ]
    },
    {
      "topic": "Gravitational Attraction Example",
      "sub_topics": [
        "Newton's law of universal gravitation states that the attractive force between two masses is proportional to the product of the masses and inversely proportional to the square of the distance between them, thus describing the gravitational interaction between bodies. The gravitational force is a vector quantity, and the force that one mass exerts on another is given by the vector that points from the second mass to the first, with the magnitude proportional to the masses and inversely proportional to the square of the distance.",
        "A vector field is a function that associates a vector to each point in space, and the gravitational field is a specific example of a vector field that describes the gravitational force that a mass exerts on other masses in different positions. The superposition of the gravitational field allows calculating the total field due to a collection of masses, summing vectorially the individual fields of each mass, which is essential to determine the gravitational force in complex situations.",
        "The approximation of the gravitational field divides the plate into small cells, approximates the field due to each cell, and then sums the results to obtain an estimate of the field due to the entire plate. The double Riemann integral can be used to calculate the gravitational field of a plate, expressing the sum over the cells as an integral over the area of the plate, thus allowing to calculate the gravitational field with precision.",
        "When calculating the gravitational field of a circular plate, circular symmetry can be exploited using polar coordinates, which simplifies the integral and allows to obtain a solution more easily."
      ]
    },
    {
      "topic": "Area and Jordan Content",
      "sub_topics": [
        "The Riemann integral is defined by partitioning the region into small parts, multiplying the 'size' of each part by a value of the function in that part, and summing these products. Then, the process is repeated with increasingly smaller parts, and the limit of the computed sums is taken.",
        "The Jordan content provides a precise way to define the 'size' of a region, which is its area, ensuring that the area is well-defined and that the integral converges to a unique value. The Jordan content as a generalization of the intuitive notion of area, which assigns a size to certain subsets of the plane; the method involves covering the set with grid squares and refining the grid to obtain increasingly better approximations.",
        "A point p is an interior point of a set S in R² if some open disk centered at p is contained entirely in S, crucial for defining open and closed sets. A point q is an exterior point of S if it is an interior point of the complement of S in R². A point b is a boundary point of S if it is neither an interior point nor an exterior point of S. Rigorous definitions of interior point, exterior point and boundary point of a set, essential to define open and closed sets; a set is open if it contains only interior points and closed if it contains all its boundary points.",
        "A set is closed if it contains all its boundary points and open if it contains none of them, concepts fundamental in topology. The definition of open and closed sets using disks; an open disk of radius r around a point p is the set of all points whose distance from p is less than r; a closed disk includes the points whose distance is less than or equal to r.",
        "The interior of S is the set of interior points of S, the boundary of S is the set of boundary points of S, and the closure of S is the union of S and its boundary. A set is Jordan measurable (or a J set) if its interior and exterior agree, and its Jordan content is J(S). The Jordan content provides a precise notion of size that captures the intuitive ideas about area, extends immediately to higher dimensions and fits well with the integration process.",
        "A set has zero Jordan content if it can be covered by a union of squares whose total area is arbitrarily small, which is fundamental for proving the integrability of functions in regions with complex boundaries.",
        "A set S is Jordan measurable if, and only if, J(∂S) = 0. The proof makes use of the fact that S is Jordan measurable ⇔ limk→∞ (Jk(S) - Lk(S)) = 0."
      ]
    },
    {
      "topic": "Riemann and Darboux Integrals",
      "sub_topics": [
        "The Riemann integral of a function z = f(x, y) on a closed and bounded set S with area is defined using a grid of cells Q and taking the limit of the Riemann sums. A Riemann sum for f over S is an expression of the form Σ f(xi, yi) ΔAi, where (xi, yi) is a point of Qi and ΔAi is the area of Qi. This sum approximates the volume under the graph of the function. The double Riemann integral is defined as the limit of the Riemann sums as the mesh size of the grid approaches zero. If this limit exists and is independent of the choice of points (xi, yi), then f is integrable.",
        "The rigorous mathematical theory establishes that the double integral of a function over a region can be approximated by Riemann sums, where the region is divided into smaller cells and the function is evaluated at a point within each cell.",
        "A grid of integration is a collection of closed, bounded, and non-overlapping sets that cover S. The cells of the grid do not need to be congruent or have straight sides. Let G be a grid of the type we considered near the end of the previous section. Thus, the cells Q of G are closed, bounded, and non-overlapping sets that have area. We let A(Q) denote the area of Q and δ(Q) its diameter (cf. p. 291); the diameters have a finite limit ||G||, the mesh size of G. The cells of G must cover S, but do not need to cover all of R².",
        "For a Riemann sum, to interpret such a sum, it helps to let f be positive and continuous, as in the figure above. Then f(xi,yi) is approximately the height of the prism Pi which has base Qi, vertical sides and an irregular top formed by the graph of f; f(xi,yi) ΔAi is approximately its volume.",
        "A constant function f(x, y) = c is integrable over every set S that has area, and the integral of f over S is c times the area of S.",
        "The Darboux sums are constructed using the upper and lower bounds of a function in each cell of a grid, providing upper and lower limits for the value of the integral. The lower Darboux sum for f over S and the grid G is, respectively, DG(f,S) = Σmi ΔAi,DG(f,S) = ΣMiΔAi.",
        "The lower Darboux integral is the smallest upper bound of the lower Darboux sums, and the upper Darboux integral is the largest lower bound of the upper Darboux sums. Let D(f,S) be the least upper bound of the numbers DG(f,S), over all grids G. Similarly, let D(f,S) be the greatest lower bound of the numbers DG(f,S).",
        "A function is Darboux integrable if its upper and lower Darboux integrals are equal, and the Darboux integral is the common value. The Riemann and Darboux integrals are equivalent. The theorem of the equivalence of Riemann and Darboux integrability: If f is Riemann integrable in S, then it is also Darboux integrable, and the two integrals are equal.",
        "If f is limited and continuous in S\\\\\\\\\\\\, where Z is a subset of S with A(Z) = 0, then f is integrable in S. In addition, restricted Riemann integrals, using only the cells contained in the interior of the integration domain, have the same limit as the unrestricted sums."
      ]
    },
    {
      "topic": "Area and Jordan Content",
      "sub_topics": [
        "The Jordan content as a generalization of the intuitive notion of area, which assigns a size to certain subsets of the plane; the method involves covering the set with grid squares and refining the grid to obtain increasingly better approximations.",
        "Rigorous definitions of interior point, exterior point and boundary point of a set, essential to define open and closed sets; a set is open if it contains only interior points and closed if it contains all its boundary points.",
        "The definition of open and closed sets using disks; an open disk of radius r around a point p is the set of all points whose distance from p is less than r; a closed disk includes the points whose distance is less than or equal to r.",
        "Definition of the interior of a set S as the set of interior points of S, the boundary of S as the set of boundary points of S, and the closure of S as the union of S and its boundary; a set is open if it is equal to its interior and closed if it is equal to its closure.",
        "The construction of approximations for the area of a set using grid squares of width w; the area of S must be at least Lw², where L is the number of squares entirely inside S, and at most Uw², where U is the number of squares that meet S.",
        "The concept of grid refinement, where smaller squares are used to obtain better estimates of the area; the refinement process decreases the difference between the upper and lower bounds, converging to the real area of the set.",
        "The formal definition of the Jordan content using monotonic sequences of internal and external areas, obtained by refining a grid of squares; a set is measurable by Jordan if the limits of the internal and external areas are equal, and this common limit is the Jordan content."
      ]
    }
  ]
}