{
  "topics": [
    {
      "topic": "Geometry of Linear Maps",
      "sub_topics": [
        "Linear maps, such as x → y = mx, scale lengths by a factor 'm'. In higher dimensions, M: Rⁿ → Rⁿ has multiplication factors affecting differentials in multiple integrals, similar to p'(s) in the transformation dx = p'(s)ds. These maps illustrate geometric transformations, altering lengths and directions.",
        "Specific linear maps demonstrate various transformations. M₁ = [[2, 0], [0, 3]] scales horizontal lengths by 2 and vertical lengths by 3. M₂ = [[1, 0], [0, -1]] reflects the plane across the horizontal axis, inverting orientation. M₃ = [[0, -2], [2, 0]] rotates by π/2 radians (90°) and dilates uniformly by a factor of 2. These examples showcase scaling, reflection, and rotation-dilation combinations.",
        "Invariant lines and their multipliers geometrically characterize a linear map. Two maps with the same multipliers acting on the same invariant lines are identical. A vector U ≠ 0 is an eigenvector of M with eigenvalue λ if MU = λU. The eigenvalue λ can be zero, indicating M has a non-trivial kernel consisting of eigenvectors with eigenvalue zero. The condition MU = λU can be rewritten as (M - λI)U = 0, where I is the identity matrix.",
        "The expression p(λ) = det(M - λI) is a polynomial in λ called the characteristic polynomial of M. The equation p(λ) = 0 is the characteristic equation of M. Each eigenvalue of M is a root of its characteristic equation. The sum of the eigenvalues of a 2x2 matrix is equal to its trace, and the product is equal to its determinant.",
        "Equivalent matrices represent the same linear map in different coordinates, related by a change-of-basis matrix G, where B = G⁻¹AG. These matrices share eigenvalues, trace, determinant, and characteristic polynomial, indicating these properties are invariant under coordinate changes.",
        "Shear transformations combine stretching with displacement parallel to an invariant line, resulting in only one invariant direction. Matrices with a zero eigenvalue cause collapse along the eigenvector's direction; these are categorized as collapses, with shear-collapse as a special case. Linear maps are classified into equivalence classes based on eigenvalues and eigendirections.",
        "Area multipliers, determined by the determinant, quantify how a linear map scales areas. The sign indicates whether the map preserves or reverses orientation. The wedge product (v ∧ w) denotes the parallelogram spanned by vectors v and w, with orientation determined by the vector order and signed area given by the determinant.",
        "In three dimensions, the cross-product (x × y) yields a vector orthogonal to x and y, with length equal to the area of the parallelogram they span, oriented by the right-hand rule. The scalar triple product (x × y) · z gives the signed volume of the parallelepiped spanned by x, y, and z, equivalent to the determinant of the matrix with x, y, z as columns.",
        "The volume multiplier for a linear map in three dimensions is the determinant, indicating how volumes are scaled, with the sign determining orientation preservation or reversal. In n-dimensional space, an ordered set of vectors has positive orientation if the determinant of the linear map taking the standard basis to those vectors is positive. The oriented n-dimensional parallelepiped is defined using the wedge product, and its volume is given by the determinant."
      ]
    },
    {
      "topic": "Equivalence Classes of 2 × 2 Matrices",
      "sub_topics": [
        "The classification of linear transformations M: R² → R² involves identifying equivalence classes of matrices based on their eigenvalues and number of eigendirections, including transformations such as zero, shear-collapse, pure dilation, shear-dilation, and rotation-dilation.",
        "The wedge product v ∧ w denotes the parallelogram generated by vectors v and w, whose order determines the direction of rotation (clockwise or counterclockwise), with v ∧ w = -w ∧ v.",
        "The signed area of a parallelogram, area(v ∧ w), is determined by two stipulations: the signed area of the unit square e₁ ∧ e₂ is +1, and area(w ∧ v) = -area(v ∧ w) for all vectors v and w.",
        "If M: R² → R² is a linear transformation, then areaM(v ∧ w) = detM × area(v ∧ w), where detM is the area multiplier of the linear transformation, and M inverts the orientation precisely when detM < 0."
      ]
    },
    {
      "topic": "Maps from Rⁿ to Rⁿ",
      "sub_topics": [
        "In R³, the cross product of two vectors (p = x × y) results in a unique vector with length equal to the area of the parallelogram and direction orthogonal to both vectors, following the positive orientation (right-hand rule).",
        "The scalar triple product (x × y) · z represents the signed volume of the oriented parallelepiped x ∧ y ∧ z, being negative when the parallelepiped has a negative orientation.",
        "The signed volume of the oriented parallelepiped x ∧ y ∧ z is given by the determinant of the matrix whose columns are the coordinates of x, y, and z, respectively.",
        "The volume multiplier for a linear transformation M: R³ → R³ is detM, and M inverts the orientation precisely when detM < 0.",
        "Although we cannot directly visualize Rⁿ for n > 3, geometric concepts like vector length and angle between vectors are extended by analogy, where the vector x has length ||x|| = √(x·x) and the angle θ between x and y is given by θ = arccos((x·y) / (||x|| ||y||)).",
        "An ordered set {v₁, v₂,...,vₙ} has a positive orientation if detV > 0, where V: Rⁿ → Rⁿ is the linear transformation defined by the conditions V(eᵢ) = vᵢ for i = 1,2,...,n.",
        "The volume of an n-parallelepiped is given by vol(v₁ ∧ v₂ ∧ ... ∧ vₙ) = detV, where V is the matrix whose columns are the coordinates of vᵢ; the volume can be positive, negative, or zero.",
        "The volume multiplier of the linear transformation M: Rⁿ → Rⁿ is detM; that is, volM(v₁ ∧ ... ∧ vₙ) = detM × vol(v₁ ∧ ... ∧ vₙ) for each oriented n-parallelepiped v₁ ∧ ... ∧ vₙ, and M inverts the orientation precisely when detM < 0."
      ]
    },
    {
      "topic": "Maps from Rⁿ to Rᵖ, n ≠ p",
      "sub_topics": [
        "The kernel of a linear transformation L: Rⁿ → Rᵖ is the linear subspace kerL of Rⁿ consisting of all vectors v for which L(v) = 0, while the image of L is the linear subspace imL of the target consisting of all vectors x of the form x = L(v) for some v in Rⁿ.",
        "The rank-nullity theorem states that r + k = rank(L) + nullity(L) = dim(source of L) = n, where r is the dimension of the image of L (rank) and k is the dimension of the kernel of L (nullity).",
        "If L: Rⁿ → Rᵖ is a linear transformation with n > p, the kernel of L has positive dimension (k > 0), and if L has the general form x = L(u,v,w) = au + bv + cw, the kernel of L is the locus of points in space that satisfy the equation.",
        "The graph of an arbitrary map f: X → Y is the subset of the product X × Y defined by graph f = {(x, f(x)) | x ∈ X}, establishing a one-to-one correspondence between the source X and the graph f.",
        "If L: Rⁿ → Rᵖ is linear, then graphL is a linear subspace of the product Rⁿ × Rᵖ = Rⁿ⁺ᵖ, and the dimension of the graph is equal to the dimension of the source, that is, dimgraphL = n.",
        "A set of p independent linear equations in k + p variables implicitly defines p of the variables as linear functions of the remaining k; geometrically, the kernel of a linear transformation L: Rᵏ⁺ᵖ → Rᵖ of maximal rank p is the graph of another linear transformation M: Rᵏ → Rᵖ.",
        "If the linear transformation L: Rⁿ → Rᵖ is surjective (onto), then there exists a linear coordinate change H in the source Rⁿ that transforms L into the projection that is the identity on the final p variables.",
        "The n-volume multiplier for L is √(det(L†L)), where L: Rⁿ → Rⁿ⁺q has maximal rank n."
      ]
    }
  ]
}